Table of Contents
 Class ReinfAroundOpening
Namespace
IdeaRS.OpenModel.Detail
Assembly
IdeaRS.OpenModel.dll
Representing reinforcement around opening in IDEA StatiCa Detail
[OpenModelClass(typeof(Reinforcement))]
public class ReinfAroundOpening : ReinforcementGroup
Inheritance
object
OpenObject
OpenElementId
Reinforcement
ReinforcementGroup
ReinfAroundOpening
Inherited Members
 ReinforcementGroup.Diameter
 ReinforcementGroup.NumOfBarsInLayer
 ReinforcementGroup.CoverFromSetting
 ReinforcementGroup.Cover
 ReinforcementGroup.EndsTypeBeg
 ReinforcementGroup.EndsTypeEnd
 ReinforcementGroup.DiameterOfMandrel
 Reinforcement.ReinfId
 Reinforcement.Material
 OpenElementId.Id
 object.Equals(object)
 object.Equals(object, object)
 object.GetHashCode()
 object.GetType()
 object.MemberwiseClone()
 object.ReferenceEquals(object, object)
 object.ToString()
Constructors
 ReinfAroundOpening()
Constructor
public ReinfAroundOpening()
Properties
 AnchorLength
Anchor length of main bars
public double AnchorLength { get; set; }
Property Value
double
 DiagonalDiameter
Diameter of diagonal reinforcement
public double DiagonalDiameter { get; set; }
Property Value
double
 DiagonalDistance
Distance between diagonal reinforcement layers
public double DiagonalDistance { get; set; }
Property Value
double
 DiagonalEndsType
End type of diagonal reinforcement bar
public LongReinfEndType DiagonalEndsType { get; set; }
Property Value
LongReinfEndType
 DiagonalLength
length of diagonal bar
public double DiagonalLength { get; set; }
Property Value
double
 DiagonalNumOfBarsInLayer
Number of diagonal bars in layer
public int DiagonalNumOfBarsInLayer { get; set; }
Property Value
int
 DiagonalNumOfLayers
Number of diagonal layers
public int DiagonalNumOfLayers { get; set; }
Property Value
int
 DiagonalReinforcement
Add diagonal reinforcement
public bool DiagonalReinforcement { get; set; }
Property Value
bool
 Distance
Distance between reinforcement layers
public double Distance { get; set; }
Property Value
double
 MasterComponent
Master component of reinforcement
public ReferenceElement MasterComponent { get; set; }
Property Value
ReferenceElement
 NumOfLayers
Number of layers
public int NumOfLayers { get; set; }
Property Value
int
 Edit this page